{
  "backend/main.mo": "Motoko canister providing projects, user profiles, and access control with storage maps and create/query functions.",
  "feature_evidence.json": "Feature evidence report linking features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing their roles in auth, servers, plugins, plans, and UI.",
  "frontend/DEPLOYMENT.md": "Frontend deployment checklist outlining prerequisites and clean rebuild steps.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables, dark mode values, and global styles.",
  "frontend/index.html": "Base HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and loading providers with an auth-gated root component.",
  "frontend/src/AppProviders.tsx": "Wrapper composing AuthProvider, PlanProvider, and ServerProvider in required order.",
  "frontend/src/auth/AuthContext.tsx": "Authentication context handling signup, login, logout, and session management via localStorage.",
  "frontend/src/auth/authStorage.ts": "Implements signup, login, logout, and session handling using localStorage with basic validation and password hashing.",
  "frontend/src/auth/authTypes.ts": "Defines AuthUser and AuthSession interfaces and storage key constants.",
  "frontend/src/components/AppErrorBoundary.tsx": "Provides a React error boundary that logs errors and displays a detailed UI with toggleable error info.",
  "frontend/src/components/FileManager.tsx": "Renders a navigable file explorer for a server's file tree with breadcrumb navigation and read-only checks.",
  "frontend/src/components/PaidPluginPurchaseDialog.tsx": "A dialog for buying paid plugins supporting QR payment, redeem codes, and direct payment with success handling.",
  "frontend/src/components/ServerBrandingForm.tsx": "Allows editing server branding including logo, title, and subtitle with Minecraft color code preview.",
  "frontend/src/components/ServerCreateDialog.tsx": "Dialog for creating a new server with name and domain suffix selection.",
  "frontend/src/files/fileSeed.ts": "Provides a default Minecraft-like file tree structure with sample folders and files.",
  "frontend/src/formatting/mcFormat.tsx": "Parses text with Minecraft color codes and renders colorized React elements.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication, including loading, login, and clearing identities.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module exporting nothing, reserved for future React Query hooks.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for theme colors and layout styling.",
  "frontend/src/layout/LeftNav.tsx": "Renders the left navigation sidebar with dynamic server-specific links and a static plans link.",
  "frontend/src/layout/PanelLayout.tsx": "Defines the main panel layout combining LeftNav, TopHeader, and routed content.",
  "frontend/src/layout/TopHeader.tsx": "Displays current server info, user dropdown, and plan badge in a top navigation bar.",
  "frontend/src/main.tsx": "Initializes the app root, setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AccessSharingPage.tsx": "Allows server owners to invite or revoke user access with permission levels and shows existing shared access.",
  "frontend/src/pages/AuthPage.tsx": "Provides login and signup forms with validation, error handling, and UI tabs for authentication.",
  "frontend/src/pages/ConsolePage.tsx": "Displays a server console with auto-scrolling logs and start/stop controls based on permissions.",
  "frontend/src/pages/DashboardPage.tsx": "Shows all servers with status and stats, allowing creation and selection for navigation.",
  "frontend/src/pages/FilesPage.tsx": "Provides a file manager interface for a specific server’s filesystem.",
  "frontend/src/pages/PlansPage.tsx": "Displays the current VPS plan and allows browsing and purchasing different plans.",
  "frontend/src/pages/PlayersPage.tsx": "Lists online players for a server with basic details, or shows status messages if empty/offline.",
  "frontend/src/pages/PluginsPage.tsx": "Enables browsing, installing, uninstalling, and purchasing free or paid plugins for a server.",
  "frontend/src/pages/ServerDetailsPage.tsx": "Shows high-level server info, usage stats, and quick navigation/actions like start, stop, and page links.",
  "frontend/src/pages/SettingsPage.tsx": "Displays server settings and a branding form if the user has permission to edit them.",
  "frontend/src/plans/planCatalog.ts": "Defines the VPSPlan interface and exports a catalog of available VPS plans with specs and pricing.",
  "frontend/src/plans/PlanContext.tsx": "Provides a React context for managing the user's current VPS plan and updating it based on authentication state.",
  "frontend/src/plans/planStorage.ts": "Handles saving and loading a user's selected plan from localStorage keyed by email.",
  "frontend/src/plugins/paidPluginCatalog.ts": "Defines the PaidPlugin interface and a catalog of purchasable plugins with pricing and metadata.",
  "frontend/src/plugins/pluginCatalog.ts": "Defines the Plugin interface and exports a catalog of free server plugins with descriptions and download counts.",
  "frontend/src/servers/ServerContext.tsx": "Implements a React context for managing user servers, handling creation, selection, updates, and simulated runtime activity.",
  "frontend/src/servers/serverStorage.ts": "Provides functions to load, save, and delete servers from localStorage with user-based filtering.",
  "frontend/src/servers/serverTypes.ts": "Defines TypeScript types for Minecraft server objects, console logs, players, file nodes, and sharing permissions.",
  "frontend/src/sim/runtimeSimulator.ts": "Simulates Minecraft server console output and player activity, generating random events and chat lines. Manages player join/leave, chat, and periodic console messages.",
  "frontend/src/utils/fakeQr.ts": "Creates a fake QR code by drawing random modules and corner markers on a canvas and returning it as a data URL.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL params, storing them in sessionStorage, and managing persisted parameters across navigation. Includes helpers for clearing parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, animations, and layout settings, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Tracks overall project state, including feature implementations, requirements, and notes for domain selector and fake paid‑plugin purchase flow."
}